[
  {
    "cuestion": "API-T1-01- Pregunta: Según la definición de proyecto, ¿cuál de las siguientes características NO es propia de un proyecto?",
    "opciones": [
      "A. Es un esfuerzo temporal.",
      "B. Crea un producto, servicio o resultado único.",
      "C. Es una función repetitiva y permanente en la organización.",
      "D. Tiene un principio y un final definidos."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T1-02- Pregunta: ¿Qué diferencia principal existe entre un proyecto y una operación?",
    "opciones": [
      "A. Los proyectos son ejecutados por personas y las operaciones por máquinas.",
      "B. Los proyectos buscan mantener el negocio (Business as usual) y las operaciones buscan el cambio.",
      "C. Los proyectos son temporales y únicos, las operaciones son continuas y repetitivas.",
      "D. Las operaciones tienen recursos limitados, los proyectos no."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T1-03- Pregunta: Dentro del Sistema de Creación de Valor, ¿qué define a un Portafolio (Cartera)?",
    "opciones": [
      "A. Un conjunto de proyectos relacionados que se gestionan coordinadamente.",
      "B. Un grupo de proyectos, programas y operaciones gestionados para alcanzar objetivos estratégicos.",
      "C. Una estructura temporal para un producto específico.",
      "D. La suma de todos los activos físicos de la empresa."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-04- Pregunta: ¿Cuál es el propósito principal de gestionar proyectos dentro de un Programa?",
    "opciones": [
      "A. Obtener beneficios y control que no se lograrían gestionándolos individualmente.",
      "B. Asegurar que todos los directores de proyecto reporten al mismo jefe.",
      "C. Reducir el número de interesados en el proyecto.",
      "D. Convertir proyectos temporales en operaciones permanentes."
    ],
    "solucion": "A"
  },
  {
    "cuestion": "API-T1-05- Pregunta: ¿Quién es el responsable de proporcionar recursos financieros y apoyar al equipo de gestión en la toma de decisiones fuera de su autoridad?",
    "opciones": [
      "A. El Director del Proyecto.",
      "B. La PMO.",
      "C. El Patrocinador (Sponsor).",
      "D. El Usuario Final."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T1-06- Pregunta: Una PMO (Oficina de Dirección de Proyectos) que proporciona plantillas y buenas prácticas, pero tiene poca autoridad, se clasifica como:",
    "opciones": [
      "A. De Control.",
      "B. Directiva.",
      "C. De Soporte.",
      "D. Estratégica."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T1-07- Pregunta: En una PMO Directiva, ¿cuál es el nivel de control sobre los proyectos?",
    "opciones": [
      "A. Bajo, solo consultivo.",
      "B. Moderado, exige cumplimiento.",
      "C. Alto, gestiona directamente los proyectos.",
      "D. Nulo, solo audita resultados."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T1-08- Pregunta: ¿Cuál de los siguientes es un ejemplo de Factor Ambiental de la Empresa (EEF)?",
    "opciones": [
      "A. Plantillas de documentos.",
      "B. Condiciones del mercado y cultura organizacional.",
      "C. Lecciones aprendidas de proyectos anteriores.",
      "D. Procedimientos de control de cambios."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-09- Pregunta: ¿Cuál de los siguientes se considera un Activo de los Procesos de la Organización (APO)?",
    "opciones": [
      "A. Software informático disponible.",
      "B. Estándares gubernamentales.",
      "C. Base de conocimiento de lecciones aprendidas.",
      "D. Clima político."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T1-10- Pregunta: En cuanto al ciclo de vida del proyecto, ¿cómo se comporta el riesgo y la incertidumbre?",
    "opciones": [
      "A. Son bajos al inicio y aumentan al final.",
      "B. Son altos al inicio y disminuyen conforme avanza el proyecto.",
      "C. Se mantienen constantes.",
      "D. Dependen exclusivamente del presupuesto."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-11- Pregunta: ¿Qué caracteriza al coste de los cambios a lo largo del ciclo de vida del proyecto?",
    "opciones": [
      "A. Es alto al inicio y baja al final.",
      "B. Es bajo al inicio y aumenta significativamente hacia el final.",
      "C. Es irrelevante en proyectos ágiles.",
      "D. Siempre es proporcional a la duración."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-12- Pregunta: ¿Qué enfoque de desarrollo es ideal cuando los requisitos son claros, estables y se busca una única entrega final?",
    "opciones": [
      "A. Adaptativo (Ágil).",
      "B. Predictivo (Cascada).",
      "C. Iterativo.",
      "D. Incremental."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-13- Pregunta: El enfoque Adaptativo (Ágil) se caracteriza por:",
    "opciones": [
      "A. Definir todo el alcance detallado al inicio.",
      "B. Realizar entregas frecuentes y gestionar requisitos cambiantes.",
      "C. Evitar la participación del cliente hasta el final.",
      "D. Tener un coste de cambios muy alto."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-14- Pregunta: ¿Cuál es la diferencia entre un enfoque Híbrido y uno Predictivo?",
    "opciones": [
      "A. El híbrido no usa planificación.",
      "B. El híbrido combina partes estables (predictivas) con partes inciertas (adaptativas).",
      "C. El híbrido solo se usa en software.",
      "D. El predictivo es más moderno que el híbrido."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-15- Pregunta: Según PMBOK 8, ¿qué son los Principios?",
    "opciones": [
      "A. Áreas de conocimiento técnico.",
      "B. Pautas fundamentales para el comportamiento y la toma de decisiones.",
      "C. Procesos paso a paso.",
      "D. Herramientas de software."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-16- Pregunta: El principio 'Adopta una visión holística' se refiere a:",
    "opciones": [
      "A. Centrarse solo en el presupuesto.",
      "B. Entender el proyecto como un sistema dentro de la organización.",
      "C. Ignorar los factores externos.",
      "D. Priorizar la velocidad sobre la calidad."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-17- Pregunta: ¿Qué implica el principio 'Integra la sostenibilidad'?",
    "opciones": [
      "A. Usar solo papel reciclado.",
      "B. Considerar el impacto económico, social y ambiental a largo plazo.",
      "C. Reducir el coste del proyecto al mínimo.",
      "D. Cumplir solo las leyes actuales."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-18- Pregunta: Los Dominios de Desempeño se diferencian de las fases en que:",
    "opciones": [
      "A. Ocurren de forma secuencial (uno tras otro).",
      "B. Son áreas de enfoque que ocurren simultáneamente durante todo el proyecto.",
      "C. Solo se aplican al inicio.",
      "D. Solo los realiza el Patrocinador."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-19- Pregunta: ¿Qué dominio de desempeño se encarga de definir qué trabajo se incluye y asegurar que solo se realice lo necesario?",
    "opciones": [
      "A. Gobernanza.",
      "B. Planificación.",
      "C. Alcance.",
      "D. Entrega."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T1-20- Pregunta: En el equipo de gestión, las 'Power Skills' se refieren a:",
    "opciones": [
      "A. Habilidades técnicas de programación.",
      "B. Habilidades interpersonales como comunicación y liderazgo.",
      "C. Conocimiento de leyes laborales.",
      "D. Capacidad física para trabajar horas extra."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-21- Pregunta: El 'Business Acumen' o conocimiento del negocio permite al equipo:",
    "opciones": [
      "A. Programar más rápido.",
      "B. Alinear el proyecto con la estrategia de la organización.",
      "C. Ignorar a los interesados.",
      "D. Calcular la ruta crítica."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-22- Pregunta: ¿Cuál de los siguientes roles es responsable de priorizar el backlog en un entorno ágil?",
    "opciones": [
      "A. El Director del Proyecto.",
      "B. El Scrum Master.",
      "C. El Product Owner.",
      "D. El Patrocinador."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T1-23- Pregunta: ¿Qué organización se caracteriza por tener un Director de Proyecto con autoridad baja o nula?",
    "opciones": [
      "A. Matricial Fuerte.",
      "B. Orientada a Proyectos.",
      "C. Funcional.",
      "D. Matricial Equilibrada."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T1-24- Pregunta: En una organización 'Orientada a Proyectos', el equipo:",
    "opciones": [
      "A. No tiene hogar al finalizar el proyecto.",
      "B. Reporta principalmente al gerente funcional.",
      "C. Trabaja en el proyecto a tiempo parcial.",
      "D. Tiene poca lealtad al proyecto."
    ],
    "solucion": "A"
  },
  {
    "cuestion": "API-T1-25- Pregunta: La diferencia entre un 'Coordinador' y un 'Expedidor' en una estructura matricial débil es:",
    "opciones": [
      "A. El Expedidor toma decisiones, el Coordinador no.",
      "B. El Coordinador tiene cierto poder de decisión, el Expedidor actúa como asistente sin voto.",
      "C. Son lo mismo.",
      "D. El Expedidor reporta al CEO."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-26- Pregunta: El ciclo PDCA, base de los procesos de dirección, significa:",
    "opciones": [
      "A. Plan-Do-Check-Act (Planificar-Hacer-Verificar-Actuar).",
      "B. Process-Data-Control-Analyze.",
      "C. Program-Design-Check-Approve.",
      "D. Prevent-Detect-Correct-Analyze."
    ],
    "solucion": "A"
  },
  {
    "cuestion": "API-T1-27- Pregunta: Un proyecto caótico se define como aquel que:",
    "opciones": [
      "A. Tiene requisitos estables.",
      "B. Requiere un enfoque predictivo estricto.",
      "C. Requiere adaptación constante y es mejor evitarlo si es posible.",
      "D. Tiene un presupuesto ilimitado."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T1-28- Pregunta: ¿Qué documento se crea ANTES del Acta de Constitución para justificar la inversión?",
    "opciones": [
      "A. Plan de Dirección.",
      "B. Caso de Negocio.",
      "C. EDT.",
      "D. Registro de Riesgos."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-29- Pregunta: El rol del Business Analyst se enfoca en:",
    "opciones": [
      "A. Dirigir al equipo técnico.",
      "B. Asegurar la alineación entre necesidades del negocio y la solución.",
      "C. Aprobar el presupuesto.",
      "D. Gestionar los conflictos personales."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-30- Pregunta: ¿Qué es el valor de negocio?",
    "opciones": [
      "A. Exclusivamente el beneficio monetario.",
      "B. Cualquier beneficio tangible o intangible que mejora la organización.",
      "C. El precio de las acciones de la empresa.",
      "D. El costo total del proyecto."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-31- Pregunta: ¿Qué área de enfoque tiene como objetivo alinear el propósito con las expectativas de los stakeholders al comienzo?",
    "opciones": [
      "A. Planificación.",
      "B. Ejecución.",
      "C. Inicio.",
      "D. Cierre."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T1-32- Pregunta: En el ciclo de vida del producto, la fase de 'Madurez' suele implicar:",
    "opciones": [
      "A. La creación inicial del producto.",
      "B. El retiro del producto.",
      "C. Revisiones, actualizaciones o mantenimiento.",
      "D. La definición del caso de negocio."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T1-33- Pregunta: Un 'Interesado' (Stakeholder) es:",
    "opciones": [
      "A. Solo quien paga el proyecto.",
      "B. Solo el equipo del proyecto.",
      "C. Cualquier persona o grupo que pueda afectar o verse afectado por el proyecto.",
      "D. El cliente final exclusivamente."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T1-34- Pregunta: ¿Qué tipo de PMO ejerce una autoridad moderada y exige cumplimiento de estándares?",
    "opciones": [
      "A. De Soporte.",
      "B. De Control.",
      "C. Directiva.",
      "D. Pasiva."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-35- Pregunta: La 'Responsabilidad Social' del equipo implica:",
    "opciones": [
      "A. Maximizar el beneficio a toda costa.",
      "B. Tomar decisiones alineadas con el bien común y la ética.",
      "C. Ignorar regulaciones ambientales si son costosas.",
      "D. Priorizar los intereses del Director del Proyecto."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-36- Pregunta: La diferencia entre un proyecto, un programa y un portafolio es que:",
    "opciones": [
      "A. Un proyecto es una tarea contratada con un principio y un final, un portafolio es un grupo de proyectos con fechas de conclusión más abiertas, y un programa combina dos o más portafolios.",
      "B. Un proyecto es una tarea prolongada con un principio y un final, un programa combina dos o más proyectos no relacionados, y un portafolio combina dos o más programas.",
      "C. Un proyecto es una tarea temporal con un principio y un final, un programa es un conjunto de proyectos relacionados, y un portafolio es un grupo de proyectos y programas relacionados con un objetivo específico.",
      "D. Un proyecto es una tarea temporal con un principio y un final, un programa puede incluir otro trabajo no relacionado con el proyecto, y un portafolio incluye todos los proyectos de un determinado departamento o división."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T1-37- Pregunta: ¿Cuál de los siguientes es lo MÁS apropiado que debe hacerse en el cierre del proyecto?",
    "opciones": [
      "A. Obtener la aprobación formal de los planes de gestión.",
      "B. Confirmar que todos los requisitos del proyecto se hayan cumplido.",
      "C. Recopilar información histórica de proyectos anteriores.",
      "D. Trabajar con el cliente para determinar los criterios de aceptación."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-38- Pregunta: Comprender la cultura, las políticas y los procedimientos de la organización en la que se lleva a cabo el proyecto es MÁS difícil en:",
    "opciones": [
      "A. Organizaciones ágiles.",
      "B. Organizaciones pequeñas.",
      "C. Organizaciones globales.",
      "D. Organizaciones de fabricación."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T1-39- Pregunta: ¿Cuál de las siguientes es una característica de los procesos de dirección de proyectos?",
    "opciones": [
      "A. Innecesario.",
      "B. Estandarizado.",
      "C. Iterativo.",
      "D. Único."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T1-40- Pregunta: Durante una reunión del equipo, un miembro cuestiona las medidas utilizadas para evaluar el desempeño. ¿En qué grupo de procesos de dirección de proyectos ocurre esta situación?",
    "opciones": [
      "A. Seguimiento y Control.",
      "B. Inicio.",
      "C. Cierre.",
      "D. Ejecución."
    ],
    "solucion": "D"
  },
  {
    "cuestion": "API-T1-41- Pregunta: Un director de proyectos gestiona dos proyectos y el segundo crece cada día. Además, sabe de un proyecto similar realizado el año pasado. ¿Qué debe hacer?",
    "opciones": [
      "A. Contactar al otro director del proyecto para pedirle asistencia.",
      "B. Asegurarse de que el alcance del proyecto sea acordado por todos los interesados.",
      "C. Esperar para ver si el proyecto es impactado por el crecimiento del alcance.",
      "D. Obtener registros históricos y orientación de parte de la oficina de dirección de proyectos (PMO)."
    ],
    "solucion": "D"
  },
  {
    "cuestion": "API-T1-42- Pregunta: El ciclo de vida del proyecto difiere del proceso de la dirección de proyectos en que el proceso de la dirección de proyectos:",
    "opciones": [
      "A. No incorpora una metodología.",
      "B. Es diferente para cada industria.",
      "C. Puede generar muchos proyectos.",
      "D. Es igual para todos los proyectos."
    ],
    "solucion": "D"
  },
  {
    "cuestion": "API-T1-43- Pregunta: El MEJOR momento para asignar un proyecto al director del proyecto es durante:",
    "opciones": [
      "A. Selección de proyectos.",
      "B. Integración.",
      "C. Planificación.",
      "D. Inicio."
    ],
    "solucion": "D"
  },
  {
    "cuestion": "API-T1-44- Pregunta: Un director de proyectos detecta una variación entre la velocidad de un sistema y la planificada, y evalúa si merece respuesta. ¿En qué grupo de procesos se encuentra?",
    "opciones": [
      "A. Seguimiento y Control.",
      "B. Ejecución.",
      "C. Cierre.",
      "D. Inicio."
    ],
    "solucion": "A"
  },
  {
    "cuestion": "API-T2-01- Pregunta: ¿Qué documento autoriza formalmente la existencia del proyecto y da autoridad al Director del Proyecto?",
    "opciones": [
      "A. El Caso de Negocio.",
      "B. El Plan de Dirección del Proyecto.",
      "C. El Acta de Constitución (Project Charter).",
      "D. El contrato con el cliente."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T2-02- Pregunta: ¿En qué documento se define la 'Necesidad del Negocio' y el análisis Coste-Beneficio antes de iniciar el proyecto?",
    "opciones": [
      "A. Acta de Constitución.",
      "B. Caso de Negocio.",
      "C. Plan de Gestión de Beneficios.",
      "D. Registro de Supuestos."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-03- Pregunta: El estudio de viabilidad 'Operativa' evalúa:",
    "opciones": [
      "A. Si el proyecto es rentable económicamente.",
      "B. Si existe la tecnología necesaria.",
      "C. Si el proyecto encaja con la cultura y procesos de la empresa.",
      "D. Si cumple con la ley."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T2-04- Pregunta: ¿Cuál de los siguientes NO es un componente típico del Acta de Constitución?",
    "opciones": [
      "A. Propósito y objetivos medibles.",
      "B. EDT (WBS) detallada.",
      "C. Riesgo global del proyecto.",
      "D. Recursos financieros preaprobados."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-05- Pregunta: En un entorno Ágil, el Acta de Constitución:",
    "opciones": [
      "A. No existe.",
      "B. Es más flexible y menos detallada.",
      "C. Debe tener más de 50 páginas.",
      "D. Es inmutable."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-06- Pregunta: ¿Qué es el Plan para la Dirección del Proyecto?",
    "opciones": [
      "A. Un cronograma detallado.",
      "B. Un documento unificado que integra todos los planes subsidiarios y líneas base.",
      "C. Un listado de requisitos.",
      "D. El contrato con el proveedor."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-07- Pregunta: En el análisis de 'Hacer o Comprar', ¿qué factor favorece 'Hacer' (Insourcing)?",
    "opciones": [
      "A. La organización no tiene experiencia en el tema.",
      "B. Se quiere transferir el riesgo.",
      "C. Se requiere un control total y proteger la confidencialidad.",
      "D. El servicio es un commodity barato."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T2-08- Pregunta: Estás contratando un proveedor para un trabajo con alcance incierto y probables cambios. ¿Qué tipo de contrato pone el riesgo en el COMPRADOR?",
    "opciones": [
      "A. Precio Fijo.",
      "B. Costos Reembolsables.",
      "C. Llave en mano.",
      "D. Suma Global."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-09- Pregunta: Si el alcance está perfectamente definido y quieres que el riesgo lo asuma el VENDEDOR, ¿qué contrato usas?",
    "opciones": [
      "A. Costos Reembolsables.",
      "B. Tiempo y Materiales.",
      "C. Precio Fijo (Fixed Price).",
      "D. Costo más honorarios fijos."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T2-10- Pregunta: ¿Cuál es la diferencia principal entre QA (Aseguramiento de Calidad) y QC (Control de Calidad)?",
    "opciones": [
      "A. QA se enfoca en el producto final, QC en el proceso.",
      "B. QA se enfoca en los procesos (prevención), QC en los entregables (detección).",
      "C. QA lo hace el cliente, QC el equipo.",
      "D. Son lo mismo."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-11- Pregunta: El conocimiento 'Tácito' se define como:",
    "opciones": [
      "A. Conocimiento documentado en manuales.",
      "B. Experiencia personal, intuición y difícil de expresar.",
      "C. Datos en una base de datos.",
      "D. Archivos históricos."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-12- Pregunta: Una 'Acción Correctiva' en la gestión de cambios busca:",
    "opciones": [
      "A. Evitar que un problema ocurra en el futuro.",
      "B. Realinear el desempeño futuro con el plan original tras una desviación.",
      "C. Reparar un defecto en el producto.",
      "D. Actualizar un documento."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-13- Pregunta: En el cierre de un proyecto predictivo, es imprescindible obtener:",
    "opciones": [
      "A. Más presupuesto.",
      "B. La aceptación formal del cliente.",
      "C. Una nueva acta de constitución.",
      "D. Un cambio de alcance."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-14- Pregunta: ¿Qué dos planes son salidas del proceso 'Planificar la Gestión del Alcance'?",
    "opciones": [
      "A. Plan de Alcance y Plan de Costes.",
      "B. Plan de Alcance y Plan de Requisitos.",
      "C. EDT y Diccionario.",
      "D. Acta de Constitución y Enunciado del Alcance."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-15- Pregunta: Un requisito 'No ambiguo' significa que:",
    "opciones": [
      "A. Tiene múltiples interpretaciones.",
      "B. Solo tiene una interpretación posible.",
      "C. No se puede medir.",
      "D. No es aceptado por el cliente."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-16- Pregunta: Los requisitos que describen capacidades temporales necesarias para pasar del estado actual al futuro (ej. migración de datos) son:",
    "opciones": [
      "A. Requisitos de Negocio.",
      "B. Requisitos Funcionales.",
      "C. Requisitos de Transición.",
      "D. Requisitos de Calidad."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T2-17- Pregunta: ¿Qué técnica de elicitación utiliza consultas anónimas a expertos con varias rondas de retroalimentación?",
    "opciones": [
      "A. Tormenta de ideas.",
      "B. Técnica Delphi.",
      "C. Grupos Focales.",
      "D. Entrevistas."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-18- Pregunta: La técnica de 'Grupo Nominal' es:",
    "opciones": [
      "A. Una entrevista individual.",
      "B. Una tormenta de ideas con votación para priorizar.",
      "C. Una observación pasiva.",
      "D. Un análisis de documentos."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-19- Pregunta: En el Enunciado del Alcance, las 'Exclusiones del Proyecto' sirven para:",
    "opciones": [
      "A. Decir qué se va a hacer.",
      "B. Gestionar expectativas y evitar el Scope Creep (corrimiento del alcance).",
      "C. Definir el presupuesto.",
      "D. Listar a los interesados."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-20- Pregunta: ¿Qué es la EDT (WBS)?",
    "opciones": [
      "A. Una lista de tareas cronológica.",
      "B. Una descomposición jerárquica del alcance orientada a entregables.",
      "C. Un contrato legal.",
      "D. Un método de pago."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-21- Pregunta: El nivel más bajo de la EDT, donde se estima coste y tiempo de forma fiable, se llama:",
    "opciones": [
      "A. Fase.",
      "B. Hito.",
      "C. Paquete de Trabajo.",
      "D. Cuenta de Control."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T2-22- Pregunta: ¿Cuáles son los TRES componentes de la Línea Base del Alcance?",
    "opciones": [
      "A. Acta, Plan y EDT.",
      "B. Enunciado del Alcance, EDT y Diccionario de la EDT.",
      "C. Requisitos, Matriz de Trazabilidad y Cronograma.",
      "D. Presupuesto, Alcance y Tiempo."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-23- Pregunta: El 'Scope Creep' o corrimiento del alcance se define como:",
    "opciones": [
      "A. La expansión controlada del alcance con presupuesto extra.",
      "B. La expansión no controlada del alcance sin ajustes en tiempo, costo ni recursos.",
      "C. Dar al cliente más de lo que pidió (Gold Plating).",
      "D. Reducir el alcance por falta de tiempo."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-24- Pregunta: 'Gold Plating' consiste en:",
    "opciones": [
      "A. Añadir funcionalidades extra no solicitadas por el cliente.",
      "B. Cumplir estrictamente los requisitos.",
      "C. Cobrar más por el proyecto.",
      "D. Usar materiales de oro."
    ],
    "solucion": "A"
  },
  {
    "cuestion": "API-T2-25- Pregunta: La validación del alcance se diferencia del control de calidad en que:",
    "opciones": [
      "A. La validación busca la corrección técnica.",
      "B. La validación busca la aceptación formal del cliente.",
      "C. La validación la hace el equipo interno.",
      "D. No hay diferencia."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-26- Pregunta: En un entorno ágil, ¿quién gestiona la 'Pila del Producto' (Product Backlog)?",
    "opciones": [
      "A. El Equipo de Desarrollo.",
      "B. El Scrum Master.",
      "C. El Product Owner.",
      "D. El Cliente directamente."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T2-27- Pregunta: El Diccionario de la EDT contiene:",
    "opciones": [
      "A. Solo el nombre de la tarea.",
      "B. Información detallada técnica, responsables y criterios de aceptación de cada paquete de trabajo.",
      "C. El presupuesto total del proyecto.",
      "D. La lista de stakeholders."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-28- Pregunta: ¿Qué herramienta se usa para vincular los requisitos desde su origen hasta los entregables?",
    "opciones": [
      "A. Diagrama de Pareto.",
      "B. Matriz de Trazabilidad de Requisitos.",
      "C. Diagrama de Flujo.",
      "D. Histograma."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-29- Pregunta: El Design Thinking es un proceso:",
    "opciones": [
      "A. Lineal y rígido.",
      "B. No lineal e iterativo centrado en el usuario.",
      "C. Basado solo en datos financieros.",
      "D. Exclusivo para diseño gráfico."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-30- Pregunta: ¿Cuál de los siguientes es un Requisito No Funcional?",
    "opciones": [
      "A. 'El sistema debe calcular impuestos'.",
      "B. 'El sistema debe cargar en menos de 2 segundos'.",
      "C. 'El usuario puede registrarse'.",
      "D. 'El botón debe ser azul'."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-31- Pregunta: El contrato por 'Tiempo y Materiales' (T&M) es un híbrido útil para:",
    "opciones": [
      "A. Proyectos con alcance fijo y cerrado.",
      "B. Aumentos de personal o expertos externos cuando el alcance no está claro.",
      "C. Comprar hardware estándar.",
      "D. Transferir todo el riesgo al vendedor."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-32- Pregunta: La 'Facilitación' como habilidad interpersonal sirve para:",
    "opciones": [
      "A. Imponer la opinión del jefe.",
      "B. Guiar a un grupo hacia una decisión exitosa.",
      "C. Observar sin intervenir.",
      "D. Escribir el acta de reunión."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-33- Pregunta: ¿Qué tipo de solicitud de cambio se usa para corregir una NO conformidad en el producto?",
    "opciones": [
      "A. Acción Preventiva.",
      "B. Reparación de Defectos.",
      "C. Actualización.",
      "D. Acción Correctiva."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-34- Pregunta: ¿Cuál es el objetivo principal de la fase de Cierre?",
    "opciones": [
      "A. Despedir al equipo.",
      "B. Archivar el conocimiento, finalizar el trabajo y liberar recursos.",
      "C. Cobrar la última factura.",
      "D. Empezar el siguiente proyecto inmediatamente."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-35- Pregunta: ¿Qué documento es esencial para asegurar que no haya 'huecos' ni contradicciones en lo que pide el cliente?",
    "opciones": [
      "A. Registro de Riesgos.",
      "B. Documentación de Requisitos (con criterios de calidad).",
      "C. Factura proforma.",
      "D. Organigrama del equipo."
    ],
    "solucion": "B"
  },
  
  {
    "cuestion": "API-T1-01- Pregunta: Según el Triángulo del Talento del PMI, ¿qué habilidad se refiere al conocimiento de la estrategia, misión y objetivos de la organización?",
    "opciones": [
      "A. Ways of Working (Formas de trabajar).",
      "B. Power Skills (Habilidades de poder).",
      "C. Business Acumen (Conocimiento del negocio).",
      "D. Gestión técnica de proyectos."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T1-02- Pregunta: ¿Cuál es la función principal de un 'Project Coordinator' en una organización matricial débil?",
    "opciones": [
      "A. Tiene plena autoridad sobre el presupuesto.",
      "B. Actúa como asistente sin capacidad de decisión.",
      "C. Tiene cierto poder para tomar decisiones y reporta a un gerente de nivel superior.",
      "D. Es el dueño del producto."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T1-03- Pregunta: El principio de 'Adaptabilidad y Resiliencia' sugiere que el equipo del proyecto debe:",
    "opciones": [
      "A. Mantener el plan original a toda costa.",
      "B. Ser capaz de responder a condiciones cambiantes y recuperarse de los contratiempos.",
      "C. Evitar cualquier riesgo.",
      "D. Seguir estrictamente la metodología en cascada."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-04- Pregunta: ¿Qué diferencia existe entre 'Grado' y 'Calidad'?",
    "opciones": [
      "A. Son sinónimos.",
      "B. La calidad es la categoría asignada (ej. Lujo) y el grado es el cumplimiento de requisitos.",
      "C. El grado es la categoría asignada a productos con el mismo uso funcional y la calidad es el nivel de cumplimiento de los requisitos.",
      "D. El grado es subjetivo y la calidad objetiva."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T1-05- Pregunta: En el modelo de complejidad del proyecto, la 'Ambigüedad' se refiere a:",
    "opciones": [
      "A. La falta de claridad o confusión sobre los eventos futuros o causas.",
      "B. El comportamiento humano impredecible.",
      "C. El número de interconexiones en el sistema.",
      "D. La falta de presupuesto."
    ],
    "solucion": "A"
  },
  {
    "cuestion": "API-T1-06- Pregunta: ¿Qué documento pertenece a la fase de pre-proyecto y describe los beneficios tangibles e intangibles esperados?",
    "opciones": [
      "A. Acta de Constitución.",
      "B. Plan de Gestión de Beneficios.",
      "C. EDT.",
      "D. Registro de Lecciones Aprendidas."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-07- Pregunta: ¿Quién es el responsable último de que el Caso de Negocio se cumpla?",
    "opciones": [
      "A. El Director del Proyecto.",
      "B. El Patrocinador (Sponsor).",
      "C. El equipo técnico.",
      "D. La PMO."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-08- Pregunta: En una organización 'Matricial Fuerte', ¿quién tiene más autoridad sobre los recursos?",
    "opciones": [
      "A. El Gerente Funcional.",
      "B. El Director del Proyecto.",
      "C. Comparten autoridad al 50%.",
      "D. El Cliente."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-09- Pregunta: El enfoque de desarrollo 'Iterativo' se centra principalmente en:",
    "opciones": [
      "A. La velocidad de entrega.",
      "B. La corrección de la solución mediante retroalimentación repetida.",
      "C. Reducir costes.",
      "D. Entregar todo al final de una sola vez."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-10- Pregunta: El enfoque 'Incremental' se centra en:",
    "opciones": [
      "A. La velocidad de entrega proporcionando partes terminadas del producto frecuentemente.",
      "B. Refinar los requisitos sin entregar nada hasta el final.",
      "C. Evitar cambios.",
      "D. La planificación a largo plazo."
    ],
    "solucion": "A"
  },
  {
    "cuestion": "API-T1-11- Pregunta: Según el modelo de prominencia (Salience Model), ¿cuáles son los tres atributos para clasificar a los interesados?",
    "opciones": [
      "A. Dinero, Tiempo y Alcance.",
      "B. Poder, Legitimidad y Urgencia.",
      "C. Interés, Influencia e Impacto.",
      "D. Interno, Externo y Neutro."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-12- Pregunta: ¿Qué es el 'Tailoring' (Adaptación) en la gestión de proyectos?",
    "opciones": [
      "A. Copiar el plan de otro proyecto.",
      "B. La selección y ajuste deliberado del enfoque, la gobernanza y los procesos para que sean adecuados al proyecto específico.",
      "C. Reducir el alcance para terminar antes.",
      "D. Ignorar los procesos de calidad."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-13- Pregunta: ¿Cuál de las siguientes NO es una función típica de la PMO?",
    "opciones": [
      "A. Proveer metodologías y plantillas.",
      "B. Dar soporte y entrenamiento.",
      "C. Definir la estrategia comercial de la empresa.",
      "D. Gestionar recursos compartidos entre proyectos."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T1-14- Pregunta: En el ciclo de vida del proyecto, las revisiones de fase (Phase Gate Reviews) sirven para:",
    "opciones": [
      "A. Celebrar el final del proyecto.",
      "B. Decidir si el proyecto debe continuar a la siguiente fase, corregirse o cancelarse.",
      "C. Cambiar al Director del Proyecto.",
      "D. Aumentar el presupuesto automáticamente."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-15- Pregunta: El principio de 'Stewardship' (Administración/Mayordomía) implica actuar con:",
    "opciones": [
      "A. Rapidez y eficacia.",
      "B. Integridad, cuidado, confiabilidad y cumplimiento.",
      "C. Autoridad absoluta.",
      "D. Enfoque exclusivo en el beneficio económico."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-16- Pregunta: ¿Qué teoría de motivación clasifica las necesidades en una pirámide (Fisiológicas, Seguridad, Sociales, Estima, Autorrealización)?",
    "opciones": [
      "A. Teoría de Herzberg.",
      "B. Teoría X e Y de McGregor.",
      "C. Jerarquía de Maslow.",
      "D. Teoría de McClelland."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T1-17- Pregunta: Según la teoría de Herzberg, los 'Factores Higiénicos' (como el salario o condiciones laborales):",
    "opciones": [
      "A. Motivan a largo plazo.",
      "B. No motivan por sí mismos, pero su ausencia causa insatisfacción.",
      "C. Son irrelevantes.",
      "D. Son los únicos que importan."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-18- Pregunta: ¿Cuál es la fórmula para calcular los canales de comunicación en un equipo de 'n' personas?",
    "opciones": [
      "A. n(n-1)/2",
      "B. n^2",
      "C. 2n + 1",
      "D. (n-1)/2"
    ],
    "solucion": "A"
  },
  {
    "cuestion": "API-T1-19- Pregunta: ¿Qué tipo de comunicación sucede cuando envías un email a todo el equipo sin esperar confirmación de lectura inmediata?",
    "opciones": [
      "A. Interactiva.",
      "B. Pull (Tirar).",
      "C. Push (Empujar).",
      "D. Sincrónica."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T1-20- Pregunta: El dominio de 'Incertidumbre' trata principalmente sobre:",
    "opciones": [
      "A. La gestión de riesgos y la ambigüedad.",
      "B. La planificación del cronograma.",
      "C. La contratación de personal.",
      "D. La definición del alcance."
    ],
    "solucion": "A"
  },
  {
    "cuestion": "API-T1-21- Pregunta: ¿Qué estilo de liderazgo se centra en servir al equipo y eliminar obstáculos?",
    "opciones": [
      "A. Autocrático.",
      "B. Laissez-faire.",
      "C. Servant Leadership (Liderazgo de servicio).",
      "D. Transaccional."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T1-22- Pregunta: Un proyecto que busca cumplir requisitos regulatorios suele ser iniciado por una necesidad:",
    "opciones": [
      "A. De mercado.",
      "B. Legal o social.",
      "C. Tecnológica.",
      "D. Ecológica."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-23- Pregunta: ¿Qué es OPM (Organizational Project Management)?",
    "opciones": [
      "A. Un software de gestión.",
      "B. El marco estratégico que integra portafolios, programas y proyectos para lograr objetivos estratégicos.",
      "C. Otro nombre para la PMO.",
      "D. La gestión de operaciones."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-24- Pregunta: El 'Ciclo de Vida del Producto' comienza con:",
    "opciones": [
      "A. El Acta de Constitución.",
      "B. La introducción del producto en el mercado (o su concepción) y termina con su retiro.",
      "C. La primera reunión de equipo.",
      "D. La firma del contrato."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-25- Pregunta: ¿Qué factor NO es una restricción clásica del proyecto (Triple Restricción ampliada)?",
    "opciones": [
      "A. Alcance.",
      "B. Coste.",
      "C. Tiempo.",
      "D. La personalidad del patrocinador."
    ],
    "solucion": "D"
  },
  {
    "cuestion": "API-T1-26- Pregunta: La comunicación 'No Verbal' incluye:",
    "opciones": [
      "A. El tono de voz y el lenguaje corporal.",
      "B. Los correos electrónicos.",
      "C. Las actas de reunión.",
      "D. Las llamadas telefónicas."
    ],
    "solucion": "A"
  },
  {
    "cuestion": "API-T1-27- Pregunta: ¿Qué es un 'Stakeholder Negativo'?",
    "opciones": [
      "A. Alguien que siempre está de mal humor.",
      "B. Alguien que ve el proyecto como una amenaza y trabaja para impedirlo.",
      "C. Un proveedor que cobra mucho.",
      "D. Un miembro del equipo con poca experiencia."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-28- Pregunta: El principio de 'Pensamiento Sistémico' requiere:",
    "opciones": [
      "A. Centrarse solo en tu tarea.",
      "B. Reconocer, evaluar y responder a las interacciones dinámicas dentro y alrededor del proyecto.",
      "C. Usar software complejo.",
      "D. Ignorar los cambios externos."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-29- Pregunta: ¿Cuándo se considera que un proyecto ha terminado?",
    "opciones": [
      "A. Cuando se acaba el dinero.",
      "B. Cuando se alcanzan los objetivos o se decide terminarlo porque no se pueden cumplir.",
      "C. Cuando el gerente se va de vacaciones.",
      "D. Cuando empieza la fase de ejecución."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-30- Pregunta: La ética en la gestión de proyectos (según PMI) se basa en cuatro valores:",
    "opciones": [
      "A. Dinero, Poder, Fama, Éxito.",
      "B. Responsabilidad, Respeto, Equidad (Justicia) y Honestidad.",
      "C. Rapidez, Calidad, Coste, Alcance.",
      "D. Planificación, Ejecución, Control, Cierre."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-01- Pregunta: En el Acta de Constitución, los 'Supuestos' (Assumptions) son:",
    "opciones": [
      "A. Factores que se consideran verdaderos sin prueba ni demostración.",
      "B. Restricciones de presupuesto.",
      "C. Mentiras piadosas.",
      "D. Riesgos confirmados."
    ],
    "solucion": "A"
  },
  {
    "cuestion": "API-T2-02- Pregunta: ¿Cuál es la única salida del proceso 'Planificar la Gestión de Requisitos'?",
    "opciones": [
      "A. La lista de requisitos.",
      "B. El Plan de Gestión de Requisitos.",
      "C. La Matriz de Trazabilidad.",
      "D. El Prototipo."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-03- Pregunta: La 'Regla del 100%' en la EDT (WBS) establece que:",
    "opciones": [
      "A. El proyecto debe terminarse al 100% de calidad.",
      "B. La EDT debe incluir el 100% del trabajo definido por el alcance y nada más.",
      "C. El 100% del presupuesto debe gastarse.",
      "D. El 100% del equipo debe estar de acuerdo."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-04- Pregunta: ¿Qué es una 'Cuenta de Control' (Control Account)?",
    "opciones": [
      "A. Una cuenta bancaria.",
      "B. Un punto de control de gestión donde se integran alcance, presupuesto y cronograma y se mide el desempeño.",
      "C. Un paquete de trabajo muy pequeño.",
      "D. Un error en la contabilidad."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-05- Pregunta: La diferencia entre el Plan de Gestión del Alcance y el Plan de Gestión de Requisitos es:",
    "opciones": [
      "A. El de Alcance dice 'cómo' hacer la EDT y el Enunciado; el de Requisitos dice 'cómo' recopilar y trazar las necesidades.",
      "B. Son el mismo documento.",
      "C. El de Alcance es para el cliente y el de Requisitos para el equipo.",
      "D. El de Requisitos es opcional."
    ],
    "solucion": "A"
  },
  {
    "cuestion": "API-T2-06- Pregunta: En la gestión de cambios, ¿qué organismo es responsable de revisar, evaluar, aprobar, retrasar o rechazar los cambios al proyecto?",
    "opciones": [
      "A. El equipo de desarrollo.",
      "B. El Comité de Control de Cambios (CCB).",
      "C. El departamento de contabilidad.",
      "D. El usuario final."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-07- Pregunta: ¿Qué es un 'Cambio Constructivo' (Constructive Change)?",
    "opciones": [
      "A. Un cambio que mejora el proyecto.",
      "B. Una acción o directiva del cliente/gerencia que no se documenta formalmente pero que el contratista interpreta como un cambio de alcance.",
      "C. Un cambio en la construcción de un edificio.",
      "D. Un cambio rechazado."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-08- Pregunta: En el proceso de Validar el Alcance, la entrada clave 'Entregables Verificados' proviene del proceso de:",
    "opciones": [
      "A. Dirigir y Gestionar el Trabajo.",
      "B. Controlar la Calidad.",
      "C. Definir el Alcance.",
      "D. Cerrar el Proyecto."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-09- Pregunta: ¿Cuál de las siguientes es una técnica para 'Cerrar el Proyecto o Fase'?",
    "opciones": [
      "A. Análisis de Regresión y Tendencias.",
      "B. Prototipado.",
      "C. Descomposición.",
      "D. Tormenta de ideas."
    ],
    "solucion": "A"
  },
  {
    "cuestion": "API-T2-10- Pregunta: El 'Informe Final' del proyecto suele incluir:",
    "opciones": [
      "A. Quejas personales del equipo.",
      "B. Resumen de alto nivel, validación de objetivos, resumen de calidad, costos y cronograma final.",
      "C. El código fuente completo.",
      "D. La lista de correos enviados."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-11- Pregunta: En un contrato de Costos Reembolsables, la tarifa (Fee) representa:",
    "opciones": [
      "A. El costo de los materiales.",
      "B. La ganancia o beneficio del vendedor.",
      "C. Los impuestos.",
      "D. El sueldo del PM."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-12- Pregunta: El Punto de Asunción Total (PTA) en un contrato de precio fijo con incentivos es:",
    "opciones": [
      "A. Cuando el proyecto termina.",
      "B. El punto de costo donde el vendedor asume todos los sobrecostos adicionales.",
      "C. Cuando el comprador paga todo.",
      "D. El inicio del proyecto."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-13- Pregunta: ¿Qué documento se utiliza para asegurar que las propuestas de los vendedores sean comparables y completas?",
    "opciones": [
      "A. La factura.",
      "B. El Enunciado del Trabajo de las Adquisiciones (SOW).",
      "C. El acta de constitución.",
      "D. El plan de riesgos."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-14- Pregunta: Las 'Conferencias de Oferentes' (Bidder Conferences) sirven para:",
    "opciones": [
      "A. Elegir al vendedor más barato inmediatamente.",
      "B. Asegurar que todos los posibles vendedores tengan una comprensión clara y común de los requisitos.",
      "C. Negociar el precio final en secreto.",
      "D. Celebrar la firma del contrato."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-15- Pregunta: La técnica de 'Diagrama de Contexto' visualiza:",
    "opciones": [
      "A. El cronograma del proyecto.",
      "B. El sistema, sus interfaces y las interacciones con actores externos.",
      "C. La jerarquía del equipo.",
      "D. El flujo de caja."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-16- Pregunta: ¿Qué diferencia hay entre 'Criterios de Aceptación' y 'Definición de Hecho (DoD)' en Ágil?",
    "opciones": [
      "A. No hay diferencia.",
      "B. Los Criterios de Aceptación son específicos de una Historia de Usuario; la DoD aplica a todas las historias del backlog.",
      "C. La DoD es para el cliente y los criterios para el equipo.",
      "D. La DoD es un documento legal."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-17- Pregunta: El 'Análisis de Variación' en el Control del Alcance compara:",
    "opciones": [
      "A. El desempeño real frente a la línea base del alcance.",
      "B. El presupuesto frente al gasto.",
      "C. El equipo actual frente al equipo ideal.",
      "D. Los riesgos frente a los problemas."
    ],
    "solucion": "A"
  },
  {
    "cuestion": "API-T2-18- Pregunta: ¿Qué es el 'Product Backlog Refinement' (Refinamiento)?",
    "opciones": [
      "A. Pulir el producto final.",
      "B. La actividad continua de añadir detalle, estimaciones y orden a los elementos del backlog.",
      "C. Una reunión para despedir gente.",
      "D. El cierre del proyecto."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-19- Pregunta: Si el patrocinador se marcha de la empresa en mitad del proyecto, ¿qué debe hacer el PM?",
    "opciones": [
      "A. Cancelar el proyecto.",
      "B. Seguir como si nada.",
      "C. Buscar un nuevo patrocinador inmediatamente para mantener la autoridad y financiación.",
      "D. Asumir él mismo el rol de patrocinador."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T2-20- Pregunta: Los 'Datos de Desempeño del Trabajo' (Work Performance Data) son:",
    "opciones": [
      "A. Informes analizados y formateados.",
      "B. Observaciones y mediciones brutas identificadas durante la ejecución (ej. % completado, nº de defectos).",
      "C. Decisiones finales.",
      "D. El plan del proyecto."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-21- Pregunta: La 'Información de Desempeño del Trabajo' es:",
    "opciones": [
      "A. Los datos brutos.",
      "B. Los datos analizados en contexto e integrados para tomar decisiones.",
      "C. El informe final.",
      "D. El contrato."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-22- Pregunta: ¿Qué plan subsidiario define cómo se gestionará la configuración de los entregables y la documentación?",
    "opciones": [
      "A. Plan de Gestión de la Configuración.",
      "B. Plan de Alcance.",
      "C. Plan de Calidad.",
      "D. Plan de Recursos."
    ],
    "solucion": "A"
  },
  {
    "cuestion": "API-T2-23- Pregunta: En la Elicitación, la técnica de 'Observación' (Job Shadowing) es útil cuando:",
    "opciones": [
      "A. Los usuarios son reacios o tienen dificultades para articular sus requisitos.",
      "B. El usuario está en otro país.",
      "C. Se quiere hacer una tormenta de ideas.",
      "D. No hay presupuesto."
    ],
    "solucion": "A"
  },
  {
    "cuestion": "API-T2-24- Pregunta: El 'Scope Baseline' es inmutable a menos que:",
    "opciones": [
      "A. El PM quiera cambiarlo.",
      "B. Se apruebe una solicitud de cambio formal mediante el control integrado de cambios.",
      "C. El equipo vaya retrasado.",
      "D. Sea viernes."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-25- Pregunta: ¿Qué tipo de contrato es 'Tiempo y Materiales'?",
    "opciones": [
      "A. Cerrado y seguro.",
      "B. Híbrido, con elementos de precio fijo (precio hora) y costos reembolsables (cantidad variable).",
      "C. Solo para materiales.",
      "D. Ilegal en la administración pública."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-26- Pregunta: Un 'Diccionario de la EDT' es esencial porque:",
    "opciones": [
      "A. La EDT gráfica no tiene suficiente detalle para que el equipo sepa exactamente qué hacer.",
      "B. Lo exige la ley.",
      "C. Es bonito.",
      "D. Sirve para traducir idiomas."
    ],
    "solucion": "A"
  },
  {
    "cuestion": "API-T2-27- Pregunta: ¿Qué entrada del Acta de Constitución incluye contratos verbales o escritos previos?",
    "opciones": [
      "A. Acuerdos.",
      "B. EEF.",
      "C. APO.",
      "D. Caso de Negocio."
    ],
    "solucion": "A"
  },
  {
    "cuestion": "API-T2-28- Pregunta: La validación del alcance suele realizarse:",
    "opciones": [
      "A. Solo al final del proyecto.",
      "B. Periódicamente (ej. por fases o iteraciones) tras obtener entregables verificados por calidad.",
      "C. Antes de empezar el trabajo.",
      "D. Nunca, si el cliente confía en nosotros."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-29- Pregunta: ¿Qué es una 'Licitación' (Tender/Bid)?",
    "opciones": [
      "A. Una oferta de un vendedor para realizar un trabajo.",
      "B. Un tipo de contrato.",
      "C. Una reunión.",
      "D. Un despido."
    ],
    "solucion": "A"
  },
  {
    "cuestion": "API-T2-30- Pregunta: Si el cliente rechaza un entregable en la validación del alcance, el PM debe:",
    "opciones": [
      "A. Discutir con el cliente.",
      "B. Documentar las razones e iniciar una solicitud de cambio para la reparación de defectos.",
      "C. Ignorarlo.",
      "D. Entregarlo igualmente."
    ],
    "solucion": "B"
  },
  
  {
    "cuestion": "API-T1-100-Q01- Pregunta: ¿Cuál es el objetivo principal de la Gestión de Operaciones en comparación con la Gestión de Proyectos?",
    "opciones": [
      "A. Crear un producto único.",
      "B. Asegurar que las funciones del negocio continúen de forma eficiente y permanente.",
      "C. Definir el acta de constitución.",
      "D. Gestionar esfuerzos temporales."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-100-Q02- Pregunta: En el contexto de Creación de Valor, ¿qué es un Sistema de Entrega de Valor?",
    "opciones": [
      "A. Un software de mensajería.",
      "B. Una estructura jerárquica de carteras, programas y proyectos para alinear metas estratégicas.",
      "C. El departamento de ventas de la empresa.",
      "D. Un método para calcular el ROI."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-100-Q03- Pregunta: ¿Qué dimensión del equipo de gestión se enfoca en el pensamiento estratégico para alinear el proyecto con la organización?",
    "opciones": [
      "A. Responsabilidad Social.",
      "B. Power Skills.",
      "C. Business Acumen.",
      "D. Ways of Working."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T1-100-Q04- Pregunta: Un equipo que es autoorganizado y descentralizado es típico de un enfoque:",
    "opciones": [
      "A. Centralizado.",
      "B. Ágil / Adaptativo.",
      "C. Funcional.",
      "D. Predictivo."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-100-Q05- Pregunta: ¿Cuál es la función de soporte que se encarga de facilitar la colaboración resolviendo conflictos?",
    "opciones": [
      "A. Dirección clara.",
      "B. Facilitar la colaboración.",
      "C. Ejecutar trabajo técnico.",
      "D. Gestión de retroalimentación."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-100-Q06- Pregunta: En el ciclo de vida del producto, ¿qué fase incluye las revisiones o actualizaciones significativas?",
    "opciones": [
      "A. Introducción.",
      "B. Crecimiento.",
      "C. Madurez.",
      "D. Declive."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T1-100-Q07- Pregunta: ¿Qué enfoque de desarrollo es más útil cuando existe una gran incertidumbre sobre los requisitos?",
    "opciones": [
      "A. Predictivo.",
      "B. Cascada.",
      "C. Adaptativo.",
      "D. Estructurado."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T1-100-Q08- Pregunta: El principio 'Sé un líder responsable' implica principalmente:",
    "opciones": [
      "A. Delegar toda la responsabilidad al equipo.",
      "B. Inspirar, motivar y adaptarse a las situaciones dando ejemplo.",
      "C. Seguir el plan sin importar los cambios.",
      "D. Centrarse solo en los resultados técnicos."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-100-Q09- Pregunta: ¿Qué dominio de desempeño se alinea directamente con el marco de decisiones de la estrategia organizacional?",
    "opciones": [
      "A. Recursos.",
      "B. Gobernanza.",
      "C. Riesgo.",
      "D. Finanzas."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-100-Q10- Pregunta: ¿Cuál es una característica común entre proyectos y operaciones?",
    "opciones": [
      "A. Ambas son temporales.",
      "B. Ambas están restringidas por recursos limitados.",
      "C. Ambas crean productos únicos cada vez.",
      "D. Ambas terminan cuando se alcanza el objetivo."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-100-Q11- Pregunta: ¿Qué componente del equipo de gestión aplica métodos y enfoques de gestión del cambio adecuados al contexto?",
    "opciones": [
      "A. Power Skills.",
      "B. Ways of Working.",
      "C. Business Acumen.",
      "D. Resultados."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-100-Q12- Pregunta: ¿Cuál es el rol de un Business Analyst respecto al producto?",
    "opciones": [
      "A. Financiar el proyecto.",
      "B. Asegurar la alineación entre las necesidades del negocio y la funcionalidad del producto.",
      "C. Ejecutar el código fuente.",
      "D. Ser el jefe de la PMO."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-100-Q13- Pregunta: Un proyecto para reparar un proceso existente se clasifica como un esfuerzo para:",
    "opciones": [
      "A. Cumplir requisitos legales.",
      "B. Crear, mejorar o reparar productos/procesos.",
      "C. Cambiar estrategias tecnológicas.",
      "D. Satisfacer solicitudes sociales."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-100-Q14- Pregunta: El valor de negocio 'intangible' podría ser:",
    "opciones": [
      "A. Dinero en efectivo.",
      "B. Equipamiento físico.",
      "C. Reconocimiento de marca o prestigio.",
      "D. Acciones de la bolsa."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T1-100-Q15- Pregunta: ¿Cuál es el objetivo del dominio de desempeño 'Recursos'?",
    "opciones": [
      "A. Definir el alcance.",
      "B. Planificar, estimar y adquirir recursos humanos y físicos.",
      "C. Gestionar el presupuesto.",
      "D. Identificar riesgos."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-100-Q16- Pregunta: Un proyecto 'temporal' significa que:",
    "opciones": [
      "A. Dura para siempre.",
      "B. Tiene un inicio y un fin definidos.",
      "C. Se realiza solo cuando hay tiempo libre.",
      "D. No tiene objetivos claros."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-100-Q17- Pregunta: El principio 'Enfócate en el valor' requiere evaluar el proyecto:",
    "opciones": [
      "A. Solo al final.",
      "B. Solo al inicio.",
      "C. Continuamente durante todas las fases.",
      "D. Solo si el cliente lo pide."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T1-100-Q18- Pregunta: ¿Qué dominio gestiona el presupuesto y busca optimizar el valor financiero?",
    "opciones": [
      "A. Cronograma.",
      "B. Finanzas.",
      "C. Interesados.",
      "D. Riesgo."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-100-Q19- Pregunta: La PMO ayuda a la gobernanza mediante:",
    "opciones": [
      "A. La eliminación de los directores de proyecto.",
      "B. La estandarización, soporte y alineación estratégica.",
      "C. La reducción del alcance.",
      "D. El aumento de los riesgos."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T1-100-Q20- Pregunta: El ciclo de vida del proyecto acaba cuando:",
    "opciones": [
      "A. El producto se retira del mercado.",
      "B. Se alcanzan los objetivos declarados o se cancela.",
      "C. Empieza la fase de mantenimiento.",
      "D. El patrocinador se jubila."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-100-Q01- Pregunta: En el estudio de viabilidad, ¿qué dimensión evalúa si el proyecto cumple con el RGPD?",
    "opciones": [
      "A. Económica.",
      "B. Técnica.",
      "C. Legal.",
      "D. Operativa."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T2-100-Q02- Pregunta: ¿Qué técnica de toma de decisiones implica que una persona asume la responsabilidad en nombre del grupo?",
    "opciones": [
      "A. Unanimidad.",
      "B. Mayoría.",
      "C. Autocrática.",
      "D. Pluralidad."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T2-100-Q03- Pregunta: El Diccionario de la EDT incluye 'Referencias técnicas', ¿para qué sirven?",
    "opciones": [
      "A. Para saber quién es el jefe.",
      "B. Para proporcionar estándares o manuales necesarios para el trabajo del paquete.",
      "C. Para listar los números de teléfono.",
      "D. Para definir el precio del contrato."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-100-Q04- Pregunta: ¿Qué proceso se encarga de 'Medir para mejorar'?",
    "opciones": [
      "A. Inicio.",
      "B. Planificación.",
      "C. Monitorear y Controlar el Desempeño.",
      "D. Cierre."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T2-100-Q05- Pregunta: En un enfoque adaptativo, ¿cómo se gestionan los cambios que no se añaden al backlog?",
    "opciones": [
      "A. Se aceptan automáticamente.",
      "B. Se consideran rechazados.",
      "C. Se envían al comité de cambios formal.",
      "D. Se guardan para el siguiente proyecto."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-100-Q06- Pregunta: ¿Cuál es un beneficio del 'Outsourcing' (Comprar)?",
    "opciones": [
      "A. Incrementa el control interno.",
      "B. Permite centrarse en las fortalezas competitivas de la empresa.",
      "C. Es siempre más caro.",
      "D. Reduce la experiencia externa."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-100-Q07- Pregunta: ¿Qué documento se utiliza para clasificar gran número de ideas en grupos para su análisis?",
    "opciones": [
      "A. Mapa mental.",
      "B. Diagrama de afinidad.",
      "C. Matriz de trazabilidad.",
      "D. Histograma."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-100-Q08- Pregunta: Un requisito que indica que el sistema debe soportar 1000 usuarios concurrentes es un:",
    "opciones": [
      "A. Requisito funcional.",
      "B. Requisito no funcional (de solución).",
      "C. Requisito de transición.",
      "D. Requisito de negocio."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-100-Q09- Pregunta: ¿Qué técnica de elicitación permite ver directamente cómo los usuarios realizan su trabajo en su entorno real?",
    "opciones": [
      "A. Entrevistas.",
      "B. Observación / Conversación.",
      "C. Cuestionarios.",
      "D. Técnica Delphi."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-100-Q10- Pregunta: El método MoSCoW se utiliza para:",
    "opciones": [
      "A. Calcular el presupuesto.",
      "B. Priorización de requisitos.",
      "C. Dibujar la EDT.",
      "D. Identificar riesgos."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-100-Q11- Pregunta: En el cierre adaptativo, ¿en qué se centran las 'Retrospectivas'?",
    "opciones": [
      "A. En firmar el contrato final.",
      "B. En compartir conocimiento y gestionar riesgos pendientes.",
      "C. En despedir al Product Owner.",
      "D. En vender el producto."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-100-Q12- Pregunta: ¿Cuál es el riesgo de una 'descomposición excesiva' en la EDT?",
    "opciones": [
      "A. Que el proyecto sea muy corto.",
      "B. Causar un sobreesfuerzo de gestión no productivo.",
      "C. Que el cliente no lo entienda.",
      "D. Que falten requisitos."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-100-Q13- Pregunta: ¿Qué proceso traduce el plan de gestión de calidad en actividades concretas?",
    "opciones": [
      "A. Control de Calidad.",
      "B. Gestionar el Aseguramiento de la Calidad.",
      "C. Planificar la Calidad.",
      "D. Validar el Alcance."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-100-Q14- Pregunta: ¿Qué herramienta permite evaluar muchas ideas usando una matriz de decisiones?",
    "opciones": [
      "A. Votación.",
      "B. Análisis con múltiples criterios.",
      "C. Tormenta de ideas.",
      "D. Prototipado."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-100-Q15- Pregunta: En el cierre, la 'liberación de recursos' implica:",
    "opciones": [
      "A. Comprar nuevos equipos.",
      "B. Reasignar el personal y equipos a nuevos proyectos u operaciones.",
      "C. Eliminar los archivos del proyecto.",
      "D. Devolver el dinero al cliente."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-100-Q16- Pregunta: ¿Qué es una 'Épica' en el entorno adaptativo?",
    "opciones": [
      "A. Un requisito de muy bajo nivel.",
      "B. Un requisito de alto nivel que luego se descompone en Historias de Usuario.",
      "C. Un error en el código.",
      "D. Un miembro del equipo."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-100-Q17- Pregunta: ¿Qué documento documenta todas las características técnicas del producto software a obtener?",
    "opciones": [
      "A. Acta de Constitución.",
      "B. ERS (Especificación de Requisitos Software).",
      "C. EDT.",
      "D. Plan de Gestión de Beneficios."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-100-Q18- Pregunta: Un cambio que 'realinea los resultados futuros con el plan' es una:",
    "opciones": [
      "A. Acción preventiva.",
      "B. Acción correctiva.",
      "C. Reparación de defectos.",
      "D. Actualización."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-100-Q19- Pregunta: ¿Cuál es el propósito del 'Plan de Gestión de Requisitos' respecto a la configuración?",
    "opciones": [
      "A. Definir el sueldo de los desarrolladores.",
      "B. Definir cómo se inician los cambios, análisis de impacto y niveles de autorización.",
      "C. Comprar servidores.",
      "D. Dibujar los mapas mentales."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-100-Q20- Pregunta: 'Insourcing' significa:",
    "opciones": [
      "A. Contratar a una empresa externa.",
      "B. Hacer el trabajo internamente aprovechando la experiencia disponible.",
      "C. Comprar una licencia de software.",
      "D. Cancelar el proyecto."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-Q01- Pregunta: ¿Cuál es la característica principal que define a un proyecto frente a las operaciones?",
    "opciones": [
      "A. Es realizado por personas.",
      "B. Está restringido por recursos limitados.",
      "C. Es un esfuerzo temporal para crear un producto único.",
      "D. Es planificado, ejecutado y controlado."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T2-Q02- Pregunta: ¿En qué se diferencian los proyectos de las operaciones en cuanto a su finalización?",
    "opciones": [
      "A. Las operaciones acaban cuando se cumplen los objetivos.",
      "B. Los proyectos son permanentes para producir eficientemente.",
      "C. Los proyectos acaban cuando se alcanzan sus objetivos específicos.",
      "D. No hay diferencia, ambos son continuos."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T2-Q03- Pregunta: ¿Qué concepto describe los beneficios tangibles e intangibles que una organización obtiene de los proyectos?",
    "opciones": [
      "A. Gestión de procesos de negocio.",
      "B. Valor de negocio.",
      "C. Restricciones concurrentes.",
      "D. Gobernanza de carteras."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-Q04- Pregunta: ¿Cómo se define una Cartera (Portfolio) dentro del sistema de creación de valor?",
    "opciones": [
      "A. Un conjunto de proyectos relacionados con objetivos técnicos.",
      "B. Un grupo de proyectos y programas gestionados para alcanzar metas estratégicas.",
      "C. Una serie de fases que atraviesa un proyecto.",
      "D. Un departamento dedicado a la formación de empleados."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-Q05- Pregunta: ¿Qué nivel jerárquico agrupa proyectos relacionados para obtener beneficios que no se lograrían individualmente?",
    "opciones": [
      "A. Operaciones.",
      "B. Carteras.",
      "C. Programas.",
      "D. Tareas operativas."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T2-Q06- Pregunta: ¿Cuál es el objetivo principal de la Gestión de Proyectos?",
    "opciones": [
      "A. Maximizar el gasto de recursos.",
      "B. Alcanzar o superar el valor previsto aplicando conocimientos y técnicas.",
      "C. Eliminar la comunicación con los interesados.",
      "D. Mantener el alcance fijo e inmutable siempre."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-Q07- Pregunta: ¿Qué sucede si una de las demandas concurrentes (Alcance, Tiempo, Coste, etc.) cambia?",
    "opciones": [
      "A. No afecta a las demás.",
      "B. El proyecto se cancela automáticamente.",
      "C. Probablemente afecte a al menos una de las otras demandas.",
      "D. Solo afecta a la calidad."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T2-Q08- Pregunta: ¿Quién es cualquier persona o grupo que puede afectar o verse afectado por el resultado de un proyecto?",
    "opciones": [
      "A. Patrocinador.",
      "B. Stakeholder (Interesado).",
      "C. Director de Proyecto.",
      "D. Usuario final únicamente."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-Q09- Pregunta: ¿En qué consiste la dimensión 'Business Acumen' del equipo de gestión?",
    "opciones": [
      "A. Habilidades de comunicación efectiva.",
      "B. Capacidad para resolver conflictos técnicos.",
      "C. Pensamiento estratégico para alinear el proyecto con la organización.",
      "D. Aplicación de metodologías ágiles."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T2-Q10- Pregunta: ¿Cuál es la función principal de un Patrocinador (Sponsor)?",
    "opciones": [
      "A. Realizar el trabajo técnico del proyecto.",
      "B. Proporcionar liderazgo en decisiones fuera de la autoridad del PM.",
      "C. Definir el código fuente del producto.",
      "D. Gestionar las tareas diarias del equipo."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-Q11- Pregunta: ¿Qué tipo de PMO tiene autoridad alta y gestiona directamente los proyectos?",
    "opciones": [
      "A. De Soporte.",
      "B. De Control.",
      "C. Directiva.",
      "D. Ágil."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T2-Q12- Pregunta: ¿Qué tipo de PMO actúa con un rol consultivo y provee guías y buenas prácticas con autoridad baja?",
    "opciones": [
      "A. De Control.",
      "B. De Soporte.",
      "C. Directiva.",
      "D. Jerárquica."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-Q13- Pregunta: ¿Qué son los Factores Ambientales de la Empresa (EEFs)?",
    "opciones": [
      "A. Plantillas y políticas internas de la organización.",
      "B. Condiciones externas o internas que influyen o limitan el proyecto.",
      "C. Lecciones aprendidas de proyectos pasados.",
      "D. Bases de conocimiento de la empresa."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-Q14- Pregunta: ¿Cuál de los siguientes es un ejemplo de Activo de los Procesos de la Organización (APO)?",
    "opciones": [
      "A. Condiciones del mercado.",
      "B. Estructura organizacional.",
      "C. Procedimientos estandarizados y lecciones aprendidas.",
      "D. Cultura de la empresa."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T2-Q15- Pregunta: ¿Qué diferencia principal hay entre un Coordinador y un Expedidor de proyectos?",
    "opciones": [
      "A. El expedidor tiene poder de decisión y el coordinador no.",
      "B. El coordinador tiene cierto poder de decisión y el expedidor no.",
      "C. El coordinador es externo y el expedidor interno.",
      "D. No hay diferencia, son sinónimos."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-Q16- Pregunta: En el ciclo de vida del proyecto, ¿cómo evoluciona el riesgo y la incertidumbre?",
    "opciones": [
      "A. Son bajos al inicio y aumentan al final.",
      "B. Son altos al inicio y disminuyen hacia el final.",
      "C. Se mantienen constantes.",
      "D. Desaparecen tras la planificación."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-Q17- Pregunta: ¿Cómo afecta el tiempo al coste de los cambios en un proyecto?",
    "opciones": [
      "A. El coste de los cambios disminuye con el tiempo.",
      "B. El coste de los cambios es bajo al inicio y aumenta significativamente al final.",
      "C. El coste es siempre el mismo independientemente del momento.",
      "D. Los cambios son gratuitos en la fase de cierre."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-Q18- Pregunta: ¿Qué rol prioriza el backlog y orienta el desarrollo hacia la entrega de valor en entornos ágiles?",
    "opciones": [
      "A. Director de Proyecto.",
      "B. Business Analyst.",
      "C. Product Owner.",
      "D. Patrocinador."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T2-Q19- Pregunta: ¿Qué enfoque de desarrollo define el alcance, tiempo y coste al inicio del proyecto?",
    "opciones": [
      "A. Adaptativo.",
      "B. Híbrido.",
      "C. Predictivo (Cascada).",
      "D. Iterativo."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T2-Q20- Pregunta: ¿Qué caracteriza al enfoque Adaptativo (Ágil)?",
    "opciones": [
      "A. Los requisitos son claros y estables desde el inicio.",
      "B. Se basa en ciclos de Planificar, Realizar, Evaluar y Aprender.",
      "C. Busca una única entrega final al terminar el proyecto.",
      "D. Es ideal para proyectos con nula incertidumbre."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-Q21- Pregunta: ¿Qué área de enfoque de la dirección de proyectos define y autoriza formalmente el proyecto o fase?",
    "opciones": [
      "A. Planificación.",
      "B. Ejecución.",
      "C. Inicio.",
      "D. Cierre."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T2-Q22- Pregunta: ¿Cuál es el objetivo principal del Monitoreo y Control?",
    "opciones": [
      "A. Realizar el trabajo físico del proyecto.",
      "B. Formalizar la finalización del contrato.",
      "C. Detectar desviaciones comparando lo real frente a lo planificado.",
      "D. Definir los hitos iniciales."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T2-Q23- Pregunta: Según PMBOK 8, ¿qué elemento guía el pensamiento y comportamiento de los profesionales?",
    "opciones": [
      "A. Dominios de desempeño.",
      "B. Principios.",
      "C. Procesos técnicos.",
      "D. Plantillas de la PMO."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-Q24- Pregunta: ¿Qué principio de la DP implica entender el proyecto como un sistema dentro de la organización?",
    "opciones": [
      "A. Enfócate en el valor.",
      "B. Adopta una visión holística.",
      "C. Integra la calidad.",
      "D. Sé un líder responsable."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-Q25- Pregunta: ¿Qué dominio de desempeño se encarga de gestionar el presupuesto y estimar costos?",
    "opciones": [
      "A. Gobernanza.",
      "B. Cronograma.",
      "C. Finanzas.",
      "D. Recursos."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T2-Q26- Pregunta: ¿Qué dominio de desempeño anticipa y se prepara para disrupciones y amenazas?",
    "opciones": [
      "A. Interesados.",
      "B. Riesgo.",
      "C. Alcance.",
      "D. Finanzas."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-Q27- Pregunta: ¿Qué tipo de organización estructural tiene al Director de Proyecto con autoridad alta y recursos dedicados a tiempo completo?",
    "opciones": [
      "A. Funcional.",
      "B. Matricial Débil.",
      "C. Orientada a Proyectos.",
      "D. Matricial Equilibrada."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T2-Q28- Pregunta: ¿Qué principio de PMBOK 8 destaca la importancia de actuar con integridad y cuidado?",
    "opciones": [
      "A. Adopta una visión holística.",
      "B. Sé un líder responsable.",
      "C. Enfócate en el valor.",
      "D. Integra la sostenibilidad."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-Q29- Pregunta: ¿Qué dimensión del valor se refiere a beneficios como la contribución social o ambiental positiva?",
    "opciones": [
      "A. Tangible.",
      "B. Intangible.",
      "C. Monetario.",
      "D. De mercado."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-Q30- Pregunta: ¿Qué caracteriza a un enfoque Híbrido de desarrollo?",
    "opciones": [
      "A. No utiliza ningún tipo de planificación.",
      "B. Combina planificación estable (predictiva) con enfoques flexibles (adaptativos).",
      "C. Solo se usa en proyectos de construcción civil.",
      "D. Es el enfoque más rígido de PMBOK 8."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-36- Pregunta: Una empresa está operando en un mercado muy dinámico. ¿Cuál de los siguientes cambios debería ser el más importante para el comité del control integrado de cambios? Un cambio originado en:",
    "opciones": [
      "A. El alcance del proyecto.",
      "B. La empresa contratista.",
      "C. El mercado.",
      "D. El equipo de trabajo."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T2-37- Pregunta: En un proyecto, el principal entregable y los resultados del plan de pruebas fueron enviados al cliente para conseguir su aprobación formal. Han pasado 25 días y el cliente no contesta. ¿Qué es lo mejor que puede hacer?",
    "opciones": [
      "A. Documentar los hechos en el registro de problemas.",
      "B. Ninguna de las anteriores.",
      "C. Detener el proyecto hasta que el cliente apruebe los entregables formalmente.",
      "D. Solicitar ayuda a la dirección general."
    ],
    "solucion": "D"
  },
  {
    "cuestion": "API-T2-38- Pregunta: Todas las siguientes son técnicas de recopilación de datos que se utilizan para obtener los requisitos del proyecto, excepto:",
    "opciones": [
      "A. Juicio de expertos.",
      "B. Tormenta de ideas.",
      "C. Estudios comparativos.",
      "D. Grupos focales (focus groups)."
    ],
    "solucion": "A"
  },
  {
    "cuestion": "API-T2-39- Pregunta: El principal rol de un patrocinador comprometido con un proyecto debería ser:",
    "opciones": [
      "A. Colaborar con el director del proyecto para desarrollar el plan para la dirección del proyecto.",
      "B. Prevenir cambios innecesarios y garantizar los recursos para el proyecto.",
      "C. Integrar y comunicar.",
      "D. Identificar restricciones innecesarias."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-40- Pregunta: ¿Qué necesita para poder recopilar los requisitos de los interesados?",
    "opciones": [
      "A. Auditorías.",
      "B. Registro de interesados.",
      "C. Verificación del alcance.",
      "D. EDT."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-41- Pregunta: Lo más importante del acta de constitución del proyecto es que:",
    "opciones": [
      "A. Se identifican a los interesados.",
      "B. Se autoriza formalmente al director del proyecto a comenzar con los procesos de planificación.",
      "C. Se justifica el proyecto y su relación con el plan estratégico de la empresa.",
      "D. Se explicita en detalle el retorno de la inversión."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T2-42- Pregunta: El acta de constitución incluye una descripción del lugar donde va a desarrollarse el proyecto y limitaciones de coste y tiempo. Estas descripciones son:",
    "opciones": [
      "A. Compromiso formal de los interesados.",
      "B. Supuestos.",
      "C. Plan estratégico.",
      "D. Restricciones."
    ],
    "solucion": "D"
  },
  {
    "cuestion": "API-T2-43- Pregunta: Un proyecto está sufriendo demasiados cambios en el acta de constitución del proyecto. ¿Quién es el principal responsable para decidir si esos cambios son necesarios?",
    "opciones": [
      "A. El patrocinador.",
      "B. Todos los interesados del proyecto.",
      "C. El director del proyecto.",
      "D. El interesado principal del proyecto."
    ],
    "solucion": "A"
  },
  {
    "cuestion": "API-T2-44- Pregunta: El director del proyecto y su equipo han finalizado el proceso de definir el alcance. Durante la siguiente etapa del proyecto, ¿cuál de las siguientes afirmaciones no es cierta?",
    "opciones": [
      "A. Se debe verificar que el grado de descomposición del trabajo sea suficiente.",
      "B. Se tiene que descomponer el proyecto en paquetes de trabajo.",
      "C. Se debe controlar el alcance.",
      "D. El equipo y el director del proyecto deberían participar de la próxima etapa."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T2-45- Pregunta: En un sistema de control de cambios de un proyecto pequeño no se suele utilizar:",
    "opciones": [
      "A. Reuniones.",
      "B. Procedimientos.",
      "C. Lecciones aprendidas.",
      "D. Normas."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T3-01- Pregunta: Si el tiempo y costes del proyecto no son tan importantes como el número de recursos utilizados cada mes, ¿cuál de las siguientes es lo MEJOR que se puede hacer?",
    "opciones": [
      "A. Realizar el análisis Montecarlo.",
      "B. Realizar la optimización de recursos.",
      "C. Implementar la técnica de ejecución rápida.",
      "D. Analizar los costos del ciclo de vida."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T3-02- Pregunta: Sobre la base de lo siguiente, si necesitaras acortar la duración del proyecto, ¿qué actividad intentarías reducir para acortarlo?\n\nActividad | Actividad anterior | Duración (sem)\nInicio    | Ninguna            | 0\nA         | Inicio             | 1\nB         | Inicio             | 2\nC         | Inicio             | 6\nD         | A                  | 10\nE         | B, C               | 1\nF         | C                  | 2\nG         | D                  | 3\nH         | E                  | 9\nI         | F                  | 1\nFin       | G, H, I            | 0",
    "opciones": [
      "A. Actividad H.",
      "B. Actividad B.",
      "C. Actividad D.",
      "D. Actividad C."
    ],
    "solucion": "D"
  },
  {
    "cuestion": "API-T3-03- Pregunta: Si el estimado optimista para una actividad es de 12 días y el estimado pesimista es de 18 días, ¿cuál es la desviación estándar de esta actividad?",
    "opciones": [
      "A. 6.",
      "B. 3.",
      "C. 1,3.",
      "D. 1."
    ],
    "solucion": "D"
  },
  {
    "cuestion": "API-T3-04- Pregunta: Tienes un proyecto con las siguientes actividades: A dura 40 horas y puede comenzar después del inicio. B dura 25 horas y debe ocurrir después del inicio. C ocurre después de A y dura 35 horas. D ocurre después de B y C, y dura 30 horas. E ocurre después de C y dura 10 horas. F ocurre después de E y dura 22 horas. F y D son las últimas actividades. ¿Cuál de las siguientes es VERDADERA si la actividad B tuviese una duración de 37 horas?",
    "opciones": [
      "A. La ruta crítica sería de 67 horas.",
      "B. La ruta crítica cambiaría a Inicio, B, D, Final.",
      "C. La ruta crítica sería Inicio, A, C, E, F, Final.",
      "D. La ruta crítica se incrementaría 12 horas."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T3-05- Pregunta: ¿Cuál de los siguientes procesos incluye preguntarles a los miembros del equipo acerca de las estimaciones de tiempo para sus actividades y llegar a acuerdos sobre la fecha de calendario para cada actividad?",
    "opciones": [
      "A. Desarrollar el Acta de Constitución del Proyecto.",
      "B. Desarrollar el Cronograma.",
      "C. Definir el Alcance.",
      "D. Secuenciar las Actividades."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T3-06- Pregunta: Tu plan para la dirección del proyecto resulta en un cronograma del proyecto que es demasiado largo. Si el diagrama de red del proyecto no puede cambiar pero tienes recursos de personal adicionales, ¿qué es lo MEJOR que puedes hacer?",
    "opciones": [
      "A. Implementar la técnica de compresión.",
      "B. Implementar la técnica de ejecución rápida.",
      "C. Realizar el análisis Monte Cario.",
      "D. Nivelar los recursos."
    ],
    "solucion": "A"
  },
  {
    "cuestion": "API-T3-07- Pregunta: ¿Cuál de las siguientes GENERALMENTE se ilustra MEJOR mediante diagramas de barras que mediante diagramas de red?",
    "opciones": [
      "A. Avance o Estado.",
      "B. Relaciones lógicas.",
      "C. Rutas críticas.",
      "D. Compensaciones de recursos."
    ],
    "solucion": "A"
  },
  {
    "cuestion": "API-T3-08- Pregunta: La EDT, las estimaciones de cada paquete de trabajo y el diagrama de red están concluidos. Lo SIGUIENTE que debe hacer el director del proyecto es:",
    "opciones": [
      "A. Completar la gestión de los riesgos.",
      "B. Secuenciar las actividades.",
      "C. Validar que tengan el alcance correcto.",
      "D. Crear un cronograma preliminar y obtener la aprobación del equipo."
    ],
    "solucion": "D"
  },
  {
    "cuestion": "API-T3-09- Pregunta: Un director de proyectos está en medio de la ejecución de un proyecto de construcción muy grande cuando descubre que el tiempo que se necesita para concluir el proyecto es mayor al tiempo disponible. ¿Qué es lo MEJOR que puedes hacer?",
    "opciones": [
      "A. Reunirse con la gerencia y decirles que no se puede cumplir con la fecha requerida.",
      "B. Trabajar horas extras.",
      "C. Determinar las opciones para la compresión del cronograma y presentar a la gerencia su opción recomendada.",
      "D. Reducir el alcance del producto."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T3-10- Pregunta: Una dependencia que necesita que el diseño se finalice antes de que se pueda iniciar la implementación es un ejemplo de:",
    "opciones": [
      "A. Dependencia discrecional.",
      "B. Dependencia externa.",
      "C. Dependencia del alcance.",
      "D. Dependencia obligatoria."
    ],
    "solucion": "D"
  },
  {
    "cuestion": "API-T3-11- Pregunta: ¿Cuál de las siguientes opciones es CORRECTA?",
    "opciones": [
      "A. La ruta crítica ayuda a determinar cuánto tiempo llevará el proyecto.",
      "B. Sólo puede haber una ruta crítica.",
      "C. Un proyecto nunca puede tener una holgura negativa.",
      "D. El diagrama de red cambiará cada vez que cambie la fecha de finalización."
    ],
    "solucion": "A"
  },
  {
    "cuestion": "API-T3-12- Pregunta: ¿Cuál de las siguientes describe MEJOR la relación entre la desviación estándar y los riesgos?",
    "opciones": [
      "A. No hay relación.",
      "B. La desviación estándar te dice si la estimación es precisa.",
      "C. La desviación estándar te dice qué tan incierta es una estimación.",
      "D. La desviación estándar te dice si la estimación incluye un relleno (padding)."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T3-13- Pregunta: Una dependencia que necesita que el diseño se finalice antes de que se pueda iniciar la implementación es un ejemplo de:",
    "opciones": [
      "A. Dependencia externa.",
      "B. Dependencia discrecional.",
      "C. Dependencia obligatoria.",
      "D. Dependencia del alcance."
    ],
    "solucion": "B"
  },
  {
    "cuestion": "API-T3-14- Pregunta: Una actividad tiene un inicio temprano (ES) del día 3, un inicio tardío (LS) del día 13, una finalización temprana (EF) del día 9 y una finalización tardía (LF) del día 19. La actividad:",
    "opciones": [
      "A. Está en la ruta crítica.",
      "B. Está avanzando bien.",
      "C. No está en la ruta crítica.",
      "D. Tiene un retraso."
    ],
    "solucion": "C"
  },
  {
    "cuestion": "API-T3-15- Pregunta: ¿Cuándo se utiliza un diagrama de hitos en lugar de un diagrama de barras?",
    "opciones": [
      "A. Cuando se reporta a la gerencia.",
      "B. Cuando se realiza la planificación del proyecto.",
      "C. Cuando se reporta a los miembros del equipo.",
      "D. Cuando se realiza el análisis de riesgos."
    ],
    "solucion": "A"
  }

]